[metadata]
creation_date = "2023/12/14"

[rule]
author = ["Kaiber Yonnij"]
description = "Alert triggers via sysmon data based on MetaSploit Framework payload formatting for default Powershell reverse shell payloads."
from = "now-6m"
name = "potential_windows_shell_via_msf"
risk_score = 47
severity = "medium"
type = "query"
rule_id = "00000000-0000-0000-0000-000000000004"

query = '''
event.dataset : "windows.sysmon_operational" and process.command_line: "\"cmd.exe\"" and message: "*powershell  -w hidden -nop -c $a='*"
'''

[[rule.threat]] 
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1059"
name = "Command and Scripting Interpreter"
reference = "https://attack.mitre.org/techniques/T1059/"
[[rule.threat.technique.subtechnique]]
id = "T1059.003"
name = "Windows Command Shell"
reference = "https://attack.mitre.org/techniques/T1059/003/"

[rule.threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"
