[metadata]
creation_date = "2024/02/02"

[rule]
author = ["Kaiber Yonnij"]
description = "This alert looks for .zip files being sent via ftp."
from = "now-6m" 
name = "data_exfil_observed_via_ftp"
risk_score = 50
severity = "medium"
type = "query"
rule_id = "00000000-0000-0000-0000-000000000007"

query = '''
event.dataset : zeek.ftp and event.action : STOR and zeek.ftp.arg : *.zip
'''

[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1020"
name = "Automated Exfiltration"
reference = "https://attack.mitre.org/techniques/T1020/"

[rule.threat.tactic]
id = "TA0010"
name = "Exfiltration"
reference = "https://attack.mitre.org/tactics/TA0010/"