[metadata]
creation_date = "2023/01/11"
integration = ["endpoint"]
maturity = "production"
min_stack_comments = "New fields added: required_fields, related_integrations, setup"
min_stack_version = "8.4.0"
updated_date = "2023/10/16"

[rule]
author = ["Kaiber Yonnij"]
description = "Checks my windows.sysmon_operational data set for command line processes starting with powershell, command line parent processes containing bat, and parent process names of cmd.exe."
from = "now-6m"
name = "malicious_powershell_processes_via_bat"
risk_score = 20
severity = "medium"
type = "query"
rule_id = "00000000-0000-0000-0000-000000000003"

query = '''
event.dataset : "windows.sysmon_operational"  and process.command_line: powershell* and process.parent.command_line: *bat* and process.parent.name: cmd.exe
'''

[[rule.threat]] 
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1059"
name = "Command and Scripting Interpreter"
reference = "https://attack.mitre.org/techniques/T1059/"
[[rule.threat.technique.subtechnique]]
id = "T1059.003"
name = "Windows Command Shell"
reference = "https://attack.mitre.org/techniques/T1059/003/"

[rule.threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"
