[rule]
author = ["Kaiber Yonnij"]
description = "This alert looks for .zip files being created in a file path containing Windows\\Temp."
from = "now-6m" 
name = "data_archive_for_potential_exfil"
risk_score = 1
severity = "medium"
type = "query"
rule_id = "00000000-0000-0000-0000-000000000001"

query = '''
"event.action" : "(creation or overwrite)" and "process.name" : "*powershell.exe*" and "file.path" : "*Windows\\Temp\\*" and "file.name" : "*.zip"
'''

[[rule.threat]] 
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1074"
name = "Data Staged"
reference = "https://attack.mitre.org/techniques/T1074/"
[[rule.threat.technique.subtechnique]]
id = "T1074.001"
name = "Local Data Staging"
reference = "https://attack.mitre.org/techniques/T1074/001/"

[rule.threat.tactic]
id = "TA0009"
name = "Collection"
reference = "https://attack.mitre.org/tactics/TA0009/"
